[
{"title": "Jennifer Lopez Reveals Sweet 2nd Anniversary Gift From A-Rod: Admits She Feels Like She’s In Her 20s", "content": "Alex Rodriguez gave Jennifer Lopez the most ‘romantic’ gift for their 2nd anniversary! She recalled the sweet story from when he surprised her with the present, while on ‘Ellen’, Feb. 13! Watch J.Lo gush over A-Rod!"},
{"title": "Andy Cohen Reveals 1st Photo Of Newborn Son’s Face As He Cuddles Baby Close On Mag Cover", "content": "Just over a week after the birth of his first child, Andy Cohen is giving fans the first full glimpse of the little boy. Check out their adorable magazine cover here!"},
{"title": "Pregnant Jessica Simpson Mocks Herself After Breaking Toilet Seat & Warns Others: ‘Don’t Lean Back’", "content": "Jessica Simpson is having a super eventful pregnancy. First her feet swelled up to massive sizes and now she’s broken a toilet seat by leaning back on it. We’ve got her hilarious pic."},
{"title": "Priyanka Chopra Obsesses Over Husband Nick Jonas In Jimmy Fallon’s ‘Ew!’ — Watch Hilarious Video", "content": "Priyanka Chopra couldn’t help but gush over new hubby Nick Jonas when she appeared in the hilarious skit ‘Ew!’ on the Feb. 12 episode of ‘The Tonight Show Starring Jimmy Fallon’."},
{"title": "Kylie Jenner Tells Stormi She’s ‘So Lucky’ As They Open Her Luxury B-Day Gifts: Chanel & Gucci Gift Bags", "content": "After the birthday party comes the best part: opening the presents! Stormi Webster finally got to unwrap the luxury goodies that her A-list party guests spoiled her with."},
{"title": "Tiny Flaunts Cleavage In Skintight Top & Daisy Dukes On Set Of New Show ‘Games People Play’ — Pic", "content": "If you got it, flaunt it! Tiny showed off some major cleavage in her new Instagram pic from the set of ‘Games People Play.’ See the sexy snapshot here!"},
{"title": "Blac Chyna & Soulja Boy Dating: They’re ‘Inseparable’ — How The Hot New Romance Began", "content": "It’s true: Blac Chyna and Soulja Boy are an item! After speculation that the stars were dating, a new report claims they’ve been hot and heavy for about a week now — and it all started in a way that’s SO 2019!"},
{"title": "Ariana Grande Says She & Pete Davidson Broke Up & Got Back Together Before Split: It Was ‘Up & Down’", "content": "Ariana Grande recently revealed that she and Pete Davidson broke up and got back together before their final split! More details inside!"},
{"title": "Miranda Lambert Allegedly Dumps Salad On Woman During Confrontation At Restaurant", "content": "Miranda Lambert allegedly got into a confrontation with a woman at a restaurant – and, according to a report, ended up dumping a salad on her! Here’s what we know about the situation."},
{"title": "Christina El Moussa Reveals She & Tarek Live 2 Streets Apart, Dishes On ‘Easy’ Part Of Working With Him", "content": "There’s no bad blood between Christina and Tarek El Moussa! Christina spilled the secret to both co-parenting and working with her ex-husband in a new interview."},
{"title": "Kendall Jenner Takes 3 Hour Train From NYC To Philly Just To Support Ben Simmons’ B-Ball Game", "content": "Dedication! Kendall Jenner may have been downplaying her relationship with Ben Simmons after all. She skipped out of NYFW so she could cheer on the 76ers star. Now that’s love!"},
{"title": "Travis Scott Creates Wildly Romantic Valentine’s Day ‘Tunnel Of Love’ For Kylie Jenner — Watch", "content": "It’s official: Travis Scott wins Valentine’s Day. The rapper surprised his lady Kylie Jenner with the most EPIC V-day gift! See how he decided to lay the romance on."},
{"title": "Brad Pitt’s Sweet Birthday Gift For Jennifer Aniston Revealed For Her 50th Birthday Bash", "content": "When Brad Pitt showed up to his ex-wife, Jennifer Aniston’s 50th birthday bash on Feb. 9 in LA, he apparently arrived empty-handed. But, that was only because he had already mailed a gift to Jennifer’s home, according to a new report! Get the details!"},
{"title": "Ronnie Ortiz-Magro Went To Rehab After Being Inspired By ‘Jersey Shore’ Co-Star Mike Sorrentino", "content": "Ronnie Ortiz-Magro’s friends are so proud of him for going to rehab! We learned exclusively that it was thanks to them, especially Mike Sorrentino, that he decided to seek treatment."},
{"title": "Kyle Richards Reveals Filming ‘RHOBH’ Season 9 Feuding With Lisa Vanderpump Was ‘Very Stressful’", "content": "Kyle Richards and Lisa Vanderpump began ‘RHOBH’ season 9 feuding right out of the gate! Read inside for an EXCLUSIVE interview with Kyle about their fight!"},
{"title": "Iggy Azalea Shows Off Her Bombshell Curves In Sexy Lacy Bodysuit & Her Fans Are Here For It: ‘Yes Ma’am’", "content": "Iggy Azalea took to Instagram on Feb. 12 to show off her incredible body in a light blue lacy bodysuit and her followers couldn’t resist the massive compliments!"},
{"title": "Nick Cannon Trolls Kevin Hart For Dressing Like A ‘Teddy Bear’: Your Body’s ‘Too Big For Your Head’", "content": "Nick Cannon didn’t hold back when he roasted Kevin Hart on Instagram. Kevin dresses like a teddy bear, has Frankenstein shoes, and looks like his head’s too big, according to Nick! See the pic and comment."},
{"title": "Transgender Activist Corey Rae Slams Donald Trump’s Transgender Military Ban — ‘It’s Despicable’", "content": "Transgender activist Corey Rae, 25, blasted President Donald Trump for enacting a ban on transgender people serving in the military. “He should be thanking transgenders for their service”."},
{"title": "Rich The Kid Attacked At LA Recording Studio While Usher Inside: Multiple Shots Fired — Report", "content": "How terrifying! Usher and Rich the Kid were both recording in a West Hollywood studio when a gunman allegedly attacked Rich’s entourage in broad daylight with multiple gunshots fired. We’ve got the details."},
{"title": "Nick Cannon Calls Out Jimmy Kimmel & Fallon For Wearing Blackface: ‘These Your Late Night Kings?’", "content": "Nick Cannon came down on late night hosts Jimmy Fallon and Jimmy Kimmel for wearing blackface in the past to portray people of color in skits on Instagram — and he’s making fair points."},
{"title": "Kate Gosselin’s Twin Daughters, Cara & Mady Are Gorgeous & Grown Up At 18 — Pics With Mom", "content": "Kate Gosselin and her 18-year-old twin daughters, Cara and Mady, returned to the public eye for an appearance at a TCA event in Los Angeles on Feb. 12, to promote Kate’s new dating show, ‘Kate Plus Date’."},
{"title": "Millie Bobby Brown Hangs With Angelina Jolie’s Kids Shiloh,12, & Zahara, 14 – See Pics", "content": "‘Stranger Things’ star Millie Bobby Brown apparently has some famous new pals. The 14-year-old is chilling with Brad Pitt and Angelina Jolie’s daughters Shiloh and Zahara and we’ve got the pics."},
{"title": "Kate Gosselin Slams Jon’s Claim That She Has ‘Zero’ Contact With Collin, 14: ‘We Are Close’", "content": "Kate Gosselin is strongly denying her ex-husband Jon’s claim that she doesn’t see their 14-year-old son Collin. Here’s what she had to say."},
{"title": "Hailey Bieber ‘Dedicated’ To Supporting Justin During ‘Challenging Time’: She Loves Being His Wife", "content": "Hailey Bieber is worried about hubby Justin Bieber and she is determined to be there for him during his current reported struggles with depression."},
{"title": "Cardi B & Offset: Why She Made ‘Last Minute Decision’ To Have Him By Her Side At Grammys", "content": "Cardi B and Offset had a very public reunion at the 2019 Grammy Awards, even after Cardi was ‘so hurt’ when her husband was accused of cheating. Here’s why they still kissed on the red carpet anyways."},
{"title": "Are Blac Chyna & Soulja Boy Dating? See The Video & Pics That Are Sparking Romance Rumors", "content": "Did Blac Chyna move on from ex Kid Buu to Soulja Boy? The ‘Crank That’ rapper didn’t shy away from sharing multiple videos and pictures of them dancing and holding hands at a Grammys party!"},
{"title": "T.I.’s Hot New Body: How He Got In Best Shape Of His Life — Plus: See Before & After Pics", "content": "T.I. showed off an eye-catching shirtless pic of himself on Feb. 11 and we learned exactly how he ended up turning his body into the incredible eye-catching sight it is today!"},
{"title": "Chris Brown Given Welfare Check By Cops After Sharing Address During Offset Feud: Is He OK?", "content": "At least the cops knew where to look. Chris Brown revealed his home address during a heated fight online with Offset, which reportedly prompted the LAPD to check in to see if CB was doing okay! Well, is he?"},
{"title": "Blac Chyna Slams Rob Kardashian & Tyga For Not Paying Child Support: Listen To Wild Rant", "content": "Blac Chyna’s spilling the tea about her child support agreements with exes Tyga and Rob Kardashian! Listen to her go off on Instagram live about how Dream and King Cairo’s dads allegedly aren’t paying up."},
{"title": "Penelope Disick, 6, Gets Her Very First Haircut & Shows Off Her Cute New Makeover", "content": "New hair, who this? Penelope Disick got her first haircut, a chic bob, and she looks just like her aunt, Khloe Kardashian! See her hair makeover in a new selfie with Khloe — plus, check out before and after photos!"},
{"title": "Lisa Vanderpump’s Pal Lance Bass Reveals Why She Has So Much Drama On ‘RHOBH’", "content": "Lance Bass opened up about his friend Lisa Vanderpump and gave his opinion on why he thinks the drama on ‘Real Housewives of Beverly Hills’ is ‘not her fault’, in an EXCLUSIVE interview with HL."},
{"title": "Travis Scott’s ‘Astroworld’ Tulsa Show Gets Postponed Last Minute & Fans Wreak Havoc In Wild Videos", "content": "Things got rowdy at Travis Scott’s Oklahoma ‘Astroworld’ stop when the rapper cancelled the show last minute. See the aftermath of angry fans!"},
{"title": "Kristen Stewart & Taylor Lautner Reunite For His Birthday & ‘Twilight’ Fans Freak — See Pic", "content": "Some ‘Twilight’ friendships are forever, and that’s certainly the case for Kristen Stewart and Taylor Lautner. She attended his surprise 27th birthday bash and fans are freaking out over the reunion pic."},
{"title": "La La Anthony Reveals How She & Carmelo Got Back Together: The Secrets To Their Romantic Reunion", "content": "Carmelo and La La Anthony are officially back together…but what happened between now and April 2017, when they had split? La La filled us in!"},
{"title": "Paris Jackson Makes Out With BF Gabriel Glenn In Steamy Pic Celebrating New Music", "content": "What better way to celebrate new tunes than with a sweet smooch? Paris Jackson did just that with her beau in a Feb. 12 Instagram post, & the picture will melt your heart!"},
{"title": "Priyanka Chopra Reveals Why Marriage Hasn’t Changed Anything For Her & Nick Jonas", "content": "Life hasn’t changed for Priyanka Chopra and Nick Jonas since they got married in December, she confirmed at the ‘Isn’t It Romantic?’ premiere. Here’s why she thinks things stayed the same!"},
{"title": "Tiny Taking On Acting With Hot Recurring Role On New BET Series With ‘RHOA’s Marlo Hampton", "content": "Tiny can do it all! The Xscape singer turned reality star will be popping up on BET’s new series ‘Games People Play’ and she’s ‘hilarious’ on it, according to the show’s star, Jackie Long!"},
{"title": "Justin Bieber Suffering From ‘Depression’ & Is ‘Receiving Treatment’ To Help — Report", "content": "Oh no. While it seems like he’s living his best life being married to Hailey Baldwin, Justin Bieber is reportedly undergoing ‘counseling,’ as he’s allegedly struggling with depression."},
{"title": "Jen Harley Admits She Misses ‘Being In Love’ Amidst Latest Ronnie Ortiz-Magro Drama", "content": "After Ronnie Ortiz-Magro revealed he completed a month of rehab for depression and alcohol abuse, Jen Harley took to Instagram on Feb. 12, where she admitted she misses being in love. Does she want to get back with Ron after his rehab stint?"},
{"title": "Why Cardi B Suddenly Deleted Her Instagram: Plus — Will She Return Soon?", "content": "Cardi B devastated fans after she deactivated her Instagram on Feb. 11. But, it was the rapper who was hurt after online haters hit her with mean comments over her Best Rap Album win at the Grammys. Here’s why she went IG silent…"},
{"title": "Miley Cyrus Jokes She’s Going To ‘Blow’ Liam Hemsworth Once He’s Better: See Raunchy Message", "content": "Miley Cyrus figured out the ultimate way to make a sick Liam Hemsworth feel better AND give him a great Valentine’s Day! Read her raunchy message to her husband — if you dare."},
{"title": "True Thompson Rocks $320 Burberry Dress In Adorable New Pic Posted By Mom Khloe K", "content": "We can’t handle the cuteness that’s True Thompson wearing a tiny Burberry dress, and we’re pretty sure you won’t be able to, either! See the adorable pic of Khloe Kardashian’s little girl here!"},
{"title": "Jordan Holgerson, 16, Who Almost Died After Being Pushed Off Bridge By Friend, Wants Her To Pay", "content": "The teen gravely injured after being pushed off a bridge is speaking out after the friend who pushed her, Taylor Smith, was offered a plea deal. Watch Jordan Holgerson’s emotional interview."},
{"title": "DJ Khaled Drops 43 Lbs In Dramatic Before & After Makeover Pics: How He did It", "content": "At 250 lbs, 43 lbs less than his starting weight of 293 lbs, DJ Khaled has never looked better! Find out how the hit-maker shed some major weight, & see his new transformation here!"},
{"title": "Pete Davidson Shades Ariana Grande By Covering Up Tattoo With Word ‘Cursed’", "content": "It’s no ‘Japanese BBQ finger,’ but it’s up there. Pete Davidson continues to cover up his Ariana Grande-related tattoos. Wait — did he just throw some shade at his ex by suggesting she ‘cursed’ him?"},
{"title": "Mac Miller & Cazzie David ‘Leaned On Each Other’ After Ariana, Pete Splits", "content": "Mutual heartbreak caused Mac Miller and Cazzie David to develop a close bond following their exes Ariana Grande and Pete Davidson’s quickie engagement. We’ve got the details."},
{"title": "Ariana Grande Fangirls Over ‘Grey’s Anatomy’s Ellen Pompeo Dancing To Her Music: ‘I Can’t Breathe’", "content": "Ariana Grande ‘will never be the same’ after Ellen Pompeo shared a video of herself dancing to ‘Break Up With Your Girlfriend, I’m Bored’! Watch the fun dance here!"},
{"title": "Cardi B Reveals How She Likes To Give Oral Sex After Fan Questions The Bruises On Her Knees", "content": "Cardi B has just revealed how she likes to keep to husband Offset a happy man sexually after a fan questioned why her knees were so bruised. We’ve got her epic TMI response."},
{"title": "Kelly Ripa Claps Back At Troll Who Says Calling Her Husband Mark Consuelos ‘Daddy’ Is ‘Creepy’", "content": "A troll blasted Kelly Ripa as ‘creepy’ over her choice of words in a #mcm post dedicated to husband Mark Consuelos. Kelly had an excellent suggestion for the hater!"},
{"title": "Chrissy Teigen Is Selena Gomez’s Twin In Throwback Pic From Her Teens — Can You Tell Them Apart?", "content": "Chrissy Teigen took to Instagram on Feb. 11 to share an adorable photo of herself as a kid and fans couldn’t help but notice how much she looks like Selena Gomez!"},
{"title": "‘Vanderpump Rules’: Will Tom Sandoval & Ariana Split After He Said No Kids Is A ‘Deal-Breaker’?", "content": "Tom Sandoval made it clear that not wanting kids is a ‘deal-breaker’ in the Jan. 28 episode of ‘Vanderpump Rules,’ while girlfriend Ariana Madix is on the fence. Tom told HL if their stances have changed since!"},
{"title": "Kourtney Kardashian Thinks Sofia Richie Is ‘Young’ & ‘Hot’: Why She Doesn’t Let Jealousy Overtake Her", "content": "Numbers don’t dictate beauty, but it’s ‘natural’ for Kourtney Kardashian to compare her and Sofia Richie’s nearly two decade age difference. Here’s why Kourt fights that need to ‘keep up.’"},
{"title": "JWoww Will Fight Roger Mathews Hard To Keep Custody Of Her Kids In Divorce Battle", "content": "After Roger Mathews allegedly requested for primary physical custody of his and JWoww’s two kids, we learned that his estranged wife ‘will never just give up custody of her children.’ Here’s her plan."},
{"title": "Shane Dawson Reveals Conspiracy Theory That Chuck E Cheese Reuses Pizza & Fans Are Shook", "content": "Does Chuck E Cheese reuse leftover pizza and serve it to new customers?! That’s what Shane Dawson thinks, and he’s revealing why in this shocking new conspiracy theory video!"},
{"title": "Selena Gomez Looks Incredible In White Bikini As She Celebrates Her Best Friend Getting Married", "content": "Selena Gomez is looking her happiest and healthiest in ages, rocking a white bikini while on a girls’ trip ahead of her BFF’s wedding. We’ve got the sexy pics. "},
{"title": "Angelina Jolie Is All Smiles With Look-Alike Daughter, 10, After Brad & Jen’s Bday Reunion", "content": "Angelina Jolie appeared totally unfazed by Brad Pitt and Jennifer Aniston’s surprise reunion when she was photographed out with her daughter, Vivienne, on Feb. 11! See the smiley pics here."},
{"title": "Lauren Sanchez & Jeff Bezos Are ‘Very Happy’ & She’s Been Supportive Amid His ‘Blackmail’ Battle", "content": "Amazon CEO Jeff Bezos and rumored girlfriend Lauren Sanchez have reportedly been spending a lot of time together in L.A., and they’re not letting his ‘blackmail’ battle with AMI ruin their romance."},
{"title": "Sheck Wes Slams Justine Skye’s Claims That He ‘Abused’ Her: ‘I Never Hit Or Beat Any Woman’", "content": "Things are heating up between Justine Skye and Sheck Wes on Twitter after she accused him of organizing an ‘attack’ against her and her friends. He eventually responded, refuting the claims."},
{"title": "Ronnie Ortiz-Magro Reveals He Completed 1 Mo. Of Rehab For Depression & Alcohol Abuse", "content": "Ronnie Ortiz-Magro’s recent absence from social media can finally be explained — earlier this month, he completed a one month stint in rehab for alcohol abuse and depression."},
{"title": "‘RHOBH’s Teddi Mellencamp’s Weight Loss Makeover: How I Lost Nearly 100 Lbs. 3 Years Ago — Pics", "content": "Teddi Mellencamp revealed how she dropped nearly half her weight after once being ‘over 200 pounds’ in a chat with HL! No unhealthy hacks here — Teddi embarked on a health journey that anyone can follow."},
{"title": "Future Cancels Performance At Clive Davis’ Pre-Grammys Party Due To Ciara & Russell Wilson Attending", "content": "It appears that Future didn’t want to risk an awkward encounter with his ex Ciara and her husband Russell Wilson. HL EXCLUSIVELY learned he cancelled performing at an event because they would be attending."},
{"title": "Diana Ross, Jane Fonda & More Stars Over 70 Who Are Ageless Inspiration", "content": "70 is the new fabulous! Stars like Diana Ross, Cher, Jane Fonda, & more continue to give us MAJOR inspo through the decades. See the picture proof here!"},
{"title": "Cardi B’s Daughter, 7 Mos., Says Mama For The 1st Time After Rapper’s Epic Night At Grammys — Watch", "content": "Cardi B posted an emotional video of Kulture finally saying ‘mama’! Watch the sweet clip of the 7-month-old!"},
{"title": "50 Cent Disses Floyd Mayweather After Boxer Wears Same Outfit As Mary J. Blige: He Looks Like A ‘Jockey’", "content": "50 Cent just came at Floyd Mayweather for his style, and compared his latest outfit to a look Mary J. Blige once wore! The rapper posted a side by side photo of the boxer and singer, calling Mayweather a ‘jockey’! You’ve got to see this!"},
{"title": "Beth Chapman Looks Sun-kissed & Glam In Summer Hat & Shades Amid Throat Cancer Battle – Pic", "content": "Beth Chapman looked effortlessly chic in a photo that she shared with her social media followers on Feb. 10, much to the delight of her supportive fans."},
{"title": "Brad Pitt & Jennifer Aniston: Why He Decided To Attend Her 50th Birthday Bash 14 Yrs. After Split", "content": "Although they divorced in 2005, Brad Pitt and Jennifer Aniston reunited at her 50th birthday party in LA on February 9! But, why was Brad invited and why did he attend? A new report claims to have all the answers!"},
{"title": "Ariana Grande Ditches Ponytail & Shows Off Her Naturally Curly Bob & Fans Freak Out: She’s ‘Adorable’", "content": "Ariana Grande took to Snapchat to prove she still looks just like she did when she was 5-years-old by showing off her naturally curly hair in a video, and fans couldn’t stop complimenting her!"},
{"title": "Why Miley Cyrus & Liam Hemsworth Are ‘Strongest They’ve Ever Been’ Since Surprise Marriage", "content": "Miley Cyrus & Liam Hemsworth may have experienced some ‘bumps’ in their relationship over the years, but a source told HL EXCLUSIVELY why they’re in a great place!"},
{"title": "‘Teen Mom’ Star Kayla Sessler Pregnant With Baby No. 2 — See Her Cute Announcement", "content": "Kayla Sessler is pregnant again! The ‘Teen Mom: Young & Pregnant’ star made the big announcement on Instagram in the cutest way!"},
{"title": "Justin Theroux Shares B-Day ‘Love’ For Ex Jennifer Aniston After She Reunites With Brad Pitt", "content": "Justin Theroux proved he and Jennifer Aniston are not just on good terms, but great terms! For his ex-wife’s 50th birthday, Justin listed Jen’s most ‘fierce’ traits."},
{"title": "Kim Kardashian Shares Shocking New Face Pic & Cries That ‘Psoriasis Is the Sh-ts’", "content": "Kim Kardashian has always been open about her battle with the skin condition psoriasis. Now she’s showing off how it’s flared up big time all over her stunning face in a shocking close up photo."}
]